// 1-Конкатенація рядків: Складіть повідомлення про ваш улюблений фільм, його жанр і рік виходу, використовуючи конкатенацію через оператор + та шаблонні рядки.
let film = 'Трилогія "Володар перснів"';
let genre = 'Фентезі';
let year = '2001-2003';
let myFavoriteFilm = (film + " " + genre + " " + year);
console.log(myFavoriteFilm);

let indentation = '\n';
console.log(indentation);
// 2-Робота з екрануванням символів: Сформуйте рядок з вашим улюбленим висловом, використовуючи різні типи кавичок і включаючи в нього символи нового рядка та табуляції.
let myFfavouriteExpression = 'Ти краще будь голодним,\nаніж що-небудь їж \nі краще будь один, \nніж разом з ким попало! \n\t\t(Омар Хайям)';
console.log(myFfavouriteExpression);

let indentation2 = '\n';
console.log(indentation2);

// 3-Пошук у рядку: Визначте, на якій позиції знаходиться слово "світло" та "тьма" у вірші, і перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.
let verse = "Світло кінця тунелю, а за спиною лише темрява";
// а. На якій позиції знаходиться слово "світло" та "тьма" у вірші
console.log(verse.indexOf('Світло'));
console.log(verse.indexOf('тьма'));
// в. Перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.
console.log(verse.startsWith('Світло'));
console.log(verse.endsWith('Світло'));

let indentation3 = '\n';
console.log(indentation3);

// 4-Зміна регістру та заміна частини рядка: Перетворіть всі символи рядка на малі літери, потім замініть слово "сонце" на "місяць".
// приклад початкових даних:

// а. Перетворіть всі символи рядка на малі літери.
let phrase = "Сонце світить яскраво";
let substr = 'сонце';
let phraseToLowerCase = phrase.toLowerCase().replace(substr, 'місяць')
console.log(phraseToLowerCase);



