/* 1-Конкатенація рядків: Складіть повідомлення про ваш улюблений фільм, його жанр і рік виходу, використовуючи конкатенацію через оператор + та шаблонні рядки.
// приклад початкових даних
let film = "Інтерстеллар";
let genre = "наукова фантастика";
let year = 2014; */

console.log("1-Конкатенація рядків");
let film = "Зелена миля";
let genre = "драма";
let year = 1999;
console.log(
  "" +
    `Мій улюблений фільм - ${film}. За жанром він ${genre}. Ось цього він року:${year}`
);
let message =
  "Мій улюблений фільм - " +
  film +
  ". За жанром він " +
  genre +
  ". Ось цього він року: " +
  year;
console.log(message);

/* 2-Робота з екрануванням символів: Сформуйте рядок з вашим улюбленим висловом, використовуючи різні типи кавичок і включаючи в нього символи нового рядка та табуляції.
// приклад початкових даних:
// Краще 'запалити' свічку, ніж 'проклинати' темряву 
*/

console.log("\n2-Робота з екрануванням символів");
let string = `\n\tСвобода — це вміння сказати "так" своїм мріям.\n\tГідність — це вміння сказати "ні" своїм страхам.`;
console.log(string);

/* 3-Пошук у рядку: Визначте, на якій позиції знаходиться слово "світло" та "тьма" у вірші, і перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.
// приклад початкових даних:
let verse = "Світло кінця тунелю, а за спиною лише темрява"; */

console.log("\n3-Пошук у рядку");
let verse = "Світло кінця тунелю, а за спиною лише темрява";
console.log("\n" + verse);
let result1 = verse.indexOf("світло"); // регістр 1го символу!!!
let result2 = verse.indexOf("Світло");
let result3 = verse.indexOf("тьма"); // такого слова немає, тому результат -1
let result4 = verse.indexOf("темрява");
console.log(result1);
console.log(result2);
console.log(result3);
console.log(result4);
console.log(verse.startsWith("Світло"));
console.log(verse.endsWith("Світло"));

/* 4-Зміна регістру та заміна частини рядка: Перетворіть всі символи рядка на малі літери, потім замініть слово "сонце" на "місяць".
// приклад початкових даних:
let phrase = "Сонце світить яскраво"; */

// console.log("\n4-Зміна регістру та заміна частини рядка");
let phrase = "Сонце світить яскраво";
console.log("\n" + phrase);
// console.log(phrase.toLowerCase());
// console.log(phrase.padStart().replace("Сонце", "місяць"));
console.log(phrase.toLowerCase().replace("сонце", "місяць"));
