// 1-Конкатенація рядків: Складіть повідомлення про ваш улюблений фільм, його жанр і рік виходу, використовуючи конкатенацію через оператор + та шаблонні рядки.
// // приклад початкових даних
// let film = "Інтерстеллар";
// let genre = "наукова фантастика";
// let year = 2014;

const favoriteFilm = "Термінатор 2: Судний день";
const genre = ["наукова фантастика", "бойовик", "трилер"];
const year = 1991;

const messageAboutFilm =
  'Назва фільму - "' +
  favoriteFilm +
  '", жанр - ' +
  genre +
  ", рік виходу - " +
  year;

console.log(messageAboutFilm);

// -------------------------------------------------------------

// 2-Робота з екрануванням символів: Сформуйте рядок з вашим улюбленим висловом, використовуючи різні типи кавичок і включаючи в нього символи нового рядка та табуляції.
// // приклад початкових даних:
// // Краще 'запалити' свічку, ніж 'проклинати' темряву

const taras =
  'Отак подивишся здаля \nНа москаля, \nІ ніби справді він людина. \nІде собі мов сиротина, \nОчима блим, губами плям. \nІ десь трапляється хвилина \nйого буває навіть жаль. \nА ближче підійдеш ... \nСкотина \n\t"віршем Тараса Шевченка про москаля"';

console.log(taras);

// -------------------------------------------------------------

// 3-Пошук у рядку: Визначте, на якій позиції знаходиться слово "світло" та "тьма" у вірші, і перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.
// // приклад початкових даних:
// let verse = "Світло кінця тунелю, а за спиною лише темрява";

let verse = "Світло кінця тунелю, а за спиною лише темрява";
console.log(verse);
let normalizedVerse = verse.toLowerCase();

let lightId = normalizedVerse.indexOf("світло");
let darknessId = normalizedVerse.indexOf("тьма");

if (~lightId) {
  console.log('слово "світло" знаходиться на позиції', lightId);

  if (normalizedVerse.startsWith("світло")) {
    console.log('слово "світло" знаходиться на початку');
  }
  if (normalizedVerse.endsWith("світло")) {
    console.log('слово "світло" знаходиться в кінці');
  }
} else {
  console.log('слово "світло" відсутнє');
}

if (~darknessId) {
  console.log('слово "тьма" знаходиться на позиції', darknessId);
} else {
  console.log('слово "тьма" відсутнє');
}

// -------------------------------------------------------------

// 4-Зміна регістру та заміна частини рядка: Перетворіть всі символи рядка на малі літери, потім замініть слово "сонце" на "місяць".
// // приклад початкових даних:
// let phrase = "Сонце світить яскраво";

let phrase = "Сонце світить яскраво";

const changedPhrase = phrase.toLowerCase().replace("сонце", "місяць");
console.log(changedPhrase);
