"use strict";

// first

const film = "'Перекладач Ґая Річі'";
const genre = "Екшин";
const year = 2023;
const desq =
    "Перед завершенням своєї служби в лавах армії США в Афганістані сержант Джон Кінлі вирушає на завдання разом із невеликою командою бойових товаришів та місцевого провідника-перекладача Ахмеда. Але група потрапляє у пастку. Вижити вдається Ахмеду та Джону, який нічого не пам'ятає про той день і про те, як вижив. Він знає, що перекладач врятував йому життя і протяг його через небезпечну гірську місцевість, що кишить талібами. Три тижні родичі думали, що Джон загинув, але весь цей час Ахмед намагався доставити його в безпечне місце. І ось, перебуваючи вдома, Джон дізнається, що сім'я Ахмеда не отримала права на притулок і застрягла в Афганістані. Спонуканий почуттям провини Кінлі вирішує врятувати Ахмеда і його сім'ю для чого вирушає до Афганістану самотужки.";

console.log(film + " " + genre + " " + year + " " + desq);
console.log(
    `Назва фільму: ${film}; Жанр: ${genre}; Рік: ${year}; Опис: ${desq};`,
);
const badWord = "f644";
console.log("fd f f644".replace(badWord, "*".repeat(badWord.length)));

// second

const quote1 = "Краще 'запалити' свічку,\n\tніж \"проклинати\" темряву.";
console.log(quote1);

const quote2 =
    'Справжня "мудрість" - це знати, що ти нічого не знаєш.\n\t- Сократ';
console.log(quote2);

const quote3 = `\"Дорога в тисячу миль починається з першого кроку.\"\n\t- Лао Цзи`;
console.log(quote3);

// third

const verse = "Світло кінця тунелю, а за спиною лише темрява";
const searchWord1 = "світло";
const searchWord2 = "тьма";

console.log(verse.indexOf(searchWord1));
console.log(verse.indexOf(searchWord2));

if (verse.startsWith(searchWord1)) {
    console.log(`Слово ${searchWord1} зустрічалось на початку речення`);
} else if (verse.endsWith(searchWord1)) {
    console.log(`Слово ${searchWord1} зустрічалось в кінці речення`);
} else {
    console.log("Слово не зустрічалось");
}

// fourth

let phrase = "Сонце світить яскраво";
console.log(phrase.toLowerCase().replace("сонце", "місяць"));
