// Створити три об'єкти по наданому опису:

// Створення об'єкту "Автомобіль":
// Створіть об'єкт під назвою автомобіль.
// Об'єкт повинен мати властивості: марка, модель, рік та колір.
// Додайте метод показатьІнфо(), який буде виводити інформацію про автомобіль у форматі: "Марка: [марка], Модель: [модель], Рік: [рік], Колір: [колір]".

// Створення об'єкту "Книга":
// Створіть об'єкт під назвою книга.
// Об'єкт повинен мати властивості: назва, автор та кількістьСторінок.
// Додайте метод описКниги(), який буде виводити інформацію про книгу у форматі: "Назва книги: [назва], Автор: [автор], Кількість сторінок: [кількістьСторінок]".

// Створення об'єкту "Студент":
// Створіть об'єкт під назвою студент.
// Об'єкт повинен мати властивості: ім'я, прізвище та курс.
// Додайте метод представлення(), який буде виводити інформацію у форматі: "Привіт! Мене звати [ім'я] [прізвище], я навчаюся на [курс] курсі".

const автомобіль = {
  марка: "Toyota",
  модель: "Corolla",
  рік: 2020,
  колір: "Червоний",
  показатьІнфо() {
    console.log(
      `Марка: ${this.марка}, Модель: ${this.модель}, Рік: ${this.рік}, Колір: ${this.колір}`
    );
  },
};
автомобіль.показатьІнфо();

const книга = {
  назва: "Записки українського самашедшого",
  автор: "Ліна Костенко",
  кількістьСторінок: 364,
  описКниги() {
    console.log(
      `Назва книги: ${this.назва}, Автор: ${this.автор}, Кількість сторінок: ${this.кількістьСторінок}`
    );
  },
};
книга.описКниги();

const студент = {
  "ім'я": "Володимир",
  прізвище: "Моспан",
  курс: "JS[++]-02-06-25",
  представлення() {
    console.log(
      `Привіт! Мене звати ${this["ім'я"]} ${this.прізвище}, я навчаюся на курсі ${this.курс}`
    );
  },
};
студент.представлення();

let i = 0;
while (i++ < 5) alert(i);
