// Для кожного завдання використовуйте масив чисел [22,33,11,55,44,66]
const arr = [22, 33, 11, 55, 44, 66];
// const arr1 = [22, 33, 11, 55, 44, 66];
// const arr2 = [22, 33, 11, 55, 44, 66];
const arr3 = [22, 33, 11, 55, 44, 66];
const arr4 = [22, 33, 11, 55, 44, 66];
const arr5 = [22, 33, 11, 55, 44, 66];
// const arr = [];
console.log(`Початковий масив: [${arr}]`);
// ---------------------------------------------------------------------------------------------------
// Написати код результати роботи якого такі як у метода push.
// ---------------------------------------------------------------------------------------------------

let newNum = 77;
arr[arr.length] = newNum;
console.log(
  `Змінений масив: [${arr}], довжина зміненого масива: ${arr.length}`
);

// ---------------------------------------------------------------------------------------------------
// Написати код результати роботи якого такі як у метода pop.
// ---------------------------------------------------------------------------------------------------
const arr1 = [22, 33, 11, 55, 44, 66];
for (let index = arr1.length - 1; index >= 0; index--) {
  const element = arr1[index];
  console.log(element);
  arr1.length = arr1.length - 1;
  console.log(arr1);

  if (arr1.length === 0) console.log(undefined);
}

// ---------------------------------------------------------------------------------------------------
// Написати код результати роботи якого такі як у метода shift.
// ---------------------------------------------------------------------------------------------------
const arr2 = [22, 33, 11, 55, 44, 66];
console.log(`Видобули перший елемент масиву: ${arr2[0]}`);
for (let i = 0; i < arr2.length; i++) {
  arr2[i] = arr2[i + 1];
}
if (arr2.length === 0) console.log(undefined);
else {
  arr2.length = arr2.length - 1;
  console.log(`Змінений масив: [${arr2}]`);
}

// ---------------------------------------------------------------------------------------------------
// Написати код результати роботи якого такі як у метода unshift.
// ---------------------------------------------------------------------------------------------------

// let newNum1 = 77;
// arr3.length = arr3.length + 1;
// for (let i = arr3.length - 1; i > 0; i--) {
//   arr3[i] = arr3[i - 1];
// }
// arr3[0] = newNum1;
// console.log(
//   `Змінений масив: [${arr3}], довжина зміненого масива: ${arr3.length}`
// );

// ---------------------------------------------------------------------------------------------------
// Написати код результати роботи якого такі як у метода map (дія з елементами масиву: ділення на 11 та додавання до них від'ємного випадкового числа в діапазоні від 2 до 4).
// ---------------------------------------------------------------------------------------------------

// let newArr = [];
// let i = 0;
// for (const element of arr) {
//   newArr[i] = element / 11 + Math.floor(-Math.random()*10);
//   i++;
// }
// console.log(newArr);

// ---------------------------------------------------------------------------------------------------
// Написати код
// результати роботи якого такі як у метода filter (вибірка НЕпарних чисел які менші 33).
// ---------------------------------------------------------------------------------------------------

// let newArr = [];
// let i = 0;
// for (const num of arr) {
//   if (num % 2 !== 0 && num < 33) {
//     newArr[i] = num;
//     i++;
//   }
// }
// console.log(`Масив НЕпарних чисел, які менші 33 : [${newArr}]`);

// ---------------------------------------------------------------------------------------------------
// Написати код
// результати роботи якого такі як у метода reduce (початкове значення accumulator від'ємне (-231), необхідно отримати суму значень елементів масиву).
// ---------------------------------------------------------------------------------------------------

// let res = -231;
// for (const element of arr) {
//   res = res + element;
// }
// console.log(res);
