// Напишіть код, який буде представляти домашнє господарство через масив об'єктів, де кожен об'єкт містить інформацію про певний елемент дому чи пристрій.

// Створення масиву householdItems:
// Створіть масив householdItems, який буде містити об'єкти домашнього господарства.

// Створення об'єктів для домашнього господарства:
// Кожен об'єкт повинен мати наступні властивості:
// name: назва предмета (наприклад, "пральна машина").
// category: категорія (наприклад, "побутова техніка").
// price: вартість, грошова одиниця  - гривнія.
// inUse: булеве значення, що вказує, чи використовується предмет в даний момент.

// Додавання об'єктів до масиву:
// Додайте не менше 5 різних об'єктів до масиву householdItems, які представляють різні елементи домашнього господарства.

// Виведення інформації:
// Виведіть в консоль інформацію про всі предмети в масиві, а також окремо про ті, які використовуються в даний момент (inUse дорівнює true).

const householdItems = [];

householdItems.push(
  {
    name: "холодильник",
    category: "побутова техніка",
    price: 15_000,
    inUse: true,
  },
  {
    name: "мікрохвильова піч",
    category: "побутова техніка",
    price: 5_000,
    inUse: false,
  },
  {
    name: "морозильна камера",
    category: "побутова техніка",
    price: 6_000,
    inUse: true,
  },
  {
    name: "кавоварка",
    category: "побутова техніка",
    price: 3_000,
    inUse: false,
  },
  {
    name: "тостер",
    category: "побутова техніка",
    price: 1_000,
    inUse: false,
  }
);

for (let i = 0; i < householdItems.length; i++) {
  console.log(householdItems[i]);
}

console.log("тільки ті, що зараз використовуються:");

for (let i = 0; i < householdItems.length; i++) {
  if (householdItems[i].inUse) console.log(householdItems[i]);
}
