// Завдання 1: Пошук ключових слів або фраз у тексті

// Опис завдання:
// Напишіть код JavaScript, який буде здатний знайти всі входження заданого ключового слова або фрази в заданому тексті. Ваш код повинен виводити масив всіх знайдених ключових слів або фраз.

// Вимоги:
// Використовуйте регулярні вирази для знаходження ключових слів.
// Ігноруйте регістр (великі/маленькі букви) при пошуку.
// Виведіть результат у консоль.

// Приклад вхідних даних:
// const text = "Це приклад рядка з ключовим словом javascript і JavaScript є дуже цікавою мовою.";
// const keyword = "JavaScript";

const text =
  "Це приклад рядка з ключовим словом javascript і JavaScript є дуже цікавою мовою.";
const keyword = "JavaScript";
const regExp1 = new RegExp(keyword, "gi");
const result = text.match(regExp1);
console.log(result);

// =========================================================================

// Завдання 2: Розділення текста на рядки та слова

// Опис завдання:
// Напишіть код, який буде розділяти заданий текст на рядки або слова та виводити їх у масивах.

// Вимоги:
// Використовуйте регулярні вирази для розділення тексту.
// Спершу розділіть текст на рядки, виведіть результат.
// Далі розділіть текст на слова, виведіть результат.

// Приклад вхідних даних:
// const textToSplit = "Це є перший рядок.\nЦе є другий рядок.\nЦе є третій рядок.";

const textToSplit =
  "Це є перший рядок.\nЦе є другий рядок.\nЦе є третій рядок.";
const regForStrings = /.+/gi;
const regForWords = /[^ \p{P}\t\n]+/giu;

console.log(textToSplit.match(regForStrings));
console.log(textToSplit.match(regForWords));
