/*1-Конкатенація рядків: Складіть повідомлення про ваш улюблений фільм, його жанр і рік виходу, використовуючи конкатенацію через оператор + та шаблонні рядки.*/

let film = "Інтерстеллар ";
let genre = " наукова фантастика ";
let year = 2014;
console.log ("Інтерстеллар " + " наукова фантастика " + 2014 );
console.log (film + genre + year);

/*2-Робота з екрануванням символів: Сформуйте рядок з вашим улюбленим висловом, використовуючи різні типи кавичок і включаючи в нього символи нового рядка та табуляції.
 приклад початкових даних:
 Краще 'запалити' свічку, ніж 'проклинати' темряву*/
 const quote ="Краще 'запалити' свічку, \n\tніж 'проклинати' темряву"
 console.log (quote);

/*3-Пошук у рядку: Визначте, на якій позиції знаходиться слово "світло" та "тьма" у вірші, і перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.
 приклад початкових даних:*/
let verse = "Світло кінця тунелю, а за спиною лише темрява";
let positionLight = verse.toLowerCase().indexOf("світло");
let positionDark = verse.toLowerCase().lastIndexOf("тьма");
console.log(positionLight);
console.log(positionDark);
let startsLight = verse.toLowerCase().startsWith("світло");
let finishLight = verse.toLowerCase().endsWith("світло");
console.log (startsLight); 
console.log (finishLight);

/*4-Зміна регістру та заміна "місяць"на частини рядка: Перетворіть всі символи рядка на малі літери, потім замініть слово "сонце" .
 приклад початкових даних:*/
let phrase = "Сонце світить яскраво!";
let changPhrase = phrase.toLowerCase().replace("сонце","місяць");
console.log(changPhrase);
