// // Оператор If-Else
// Напишіть скрипт, який перевіряє число записане в початкову змінну парним. Програма повинна бути виведена в консоль "Число парне" або "Число непарне" в залежності від числа, яке призначено в початкову зміну.

let num = 18
if (num % 2 === 0) {
    console.log('число парне');
} else {
    console.log('число непарне');
}

// Оператор Switch
// Створіть програму, яка для чисел від 0 до 6  виводить назву дня тижня, відповідну цьому числу (0 - понеділок, 1 - вівторок, і т.д.). Якщо число не входить в цей діапазон, програма повинна вивести "Неправильне число".
let maxNum = 10
let minNum = 0
let randomNum = Math.floor(Math.random() * (maxNum - minNum + 1)) + minNum
console.log(randomNum);
switch (randomNum) {
    case 0: console.log('Понеділок');
        break;
    case 1: console.log('Вівторок');
        break;
    case 2: console.log('Середа');
        break;
    case 3: console.log('Четвер');
        break;
    case 4: console.log("П'ятниця");
        break;
    case 5: console.log('Субота');
        break;
    case 6: console.log('Неділя');
        break;
    default: console.log('Неправильне число');

}


// Тернарний оператор(*)
// Напишіть код, який використовує тернарний оператор, для визначення більшого з двох долів (створіть дві початкові зміни). Програма повинна виводити "Перше число більше", "Друге число більше" або "Числа рівнів", у зв'язку з цим число призначене в початкові зміни. ( підказка: тернарний оператор можна додати як одне зі знаком іншого тернарного оператора )

let numOne = 14
let numTwo = 6
const result = numOne < numTwo ? console.log("Друге число більше") : numTwo < numOne ? console.log("Перше число більше") : console.log("Числа рівнів")