/**
 * Створення об'єкту "Автомобіль"
 * @typedef {Object} Автомобіль
 * @property {string} марка - марка автомобіля
 * @property {string} модель - модель автомобіля
 * @property {string} рік - рік випуску автомобіля
 * @property {string} колір - колір автомобіля
 * @method показатьІнфо - метод, який виводить інформацію про автомобіль у форматі: "Марка: [марка], Модель: [модель], Рік: [рік], Колір: [колір]"
 * @example
 * Автомобіль.показатьІнфо() // Марка: BMW, Модель: 3 Series, Рік: 2024, Колір: black
 */
let Автомобіль = {
  марка: 'BMW',
  модель: '3 Series',
  рік: '2024',
  колір: 'black',
  показатьІнфо() {
    console.log(
      `Марка: ${this.марка}, Модель: ${this.модель}, Рік: ${this.рік}, Колір: ${this.колір}`
    );
  },
};

Автомобіль.показатьІнфо();

/**Створення об'єкту "Книга":
  * @typedef {Object} Книга
 * @property {string} назва - назва книги
 * @property {string} автор - автор книги
 * @property {number} кількістьСторінок - кількість сторінок у книзі
 * @method описКниги() - метод, який виводить інформацію про книгу у форматі: "Назва книги: [назва], Автор: [автор], Кількість сторінок: [кількістьСторінок]"
 * @example
 * book.описКниги() // Назва книги: Harry Potter, Автор: J.K. Rowling, Кількість сторінок: 300
 */

let Книга = {
  назва: 'Harry Potter',
  автор: 'J.K. Rowling',
  кількістьСторінок: 300,
  описКниги() {
    console.log(
      `Назва книги: ${this.назва}, Автор: ${this.автор}, Кількість сторінок: ${this.кількістьСторінок}`
    );
  },
};

Книга.описКниги();

/**Створення об'єкту "Студент":
  * @typedef {Object} Студент
 * @property {string} ім'я - ім'я студента
 * @property {string} прізвище - прізвище студента
 * @property {number} курс - курс студента
 * @method представлення() - метод, який виводить інформацію про студента у форматі: "Привіт! Мене звати [ім'я] [прізвище], я навчаюся на [курс] курсі"
 * @example
 * Студент.представлення() // Привіт! Мене звати Ірина Петренко, я навчаюся на 2 курсі
*/

let Студент = {
  "ім'я": 'Ірина',
  прізвище: 'Петренко',
  курс: 2,
  представлення() {
    console.log(`Привіт! Мене звати ${this["ім'я"]} ${this.прізвище}, я навчаюся на ${this.курс} курсі`);
  },
};
Студент.представлення();
