//* ЗАВДАННЯ

/* 
Оператор If-Else
Напишіть скрипт, який перевіряє, чи є число записане в початкову змінну парним. Програма повинна вивести в консоль "Число парне" або "Число непарне" в залежності від числа яке призначено у початкову змінну.

Оператор Switch
Створіть програму, яка для чисел від 0 до 6  виводить назву дня тижня, відповідну цьому числу (0 - понеділок, 1 - вівторок, і т.д.). Якщо число не входить в цей діапазон, програма повинна вивести "Неправильне число".

Тернарний оператор(*)
Напишіть код, який використовує тернарний оператор, для визначення більшого з двох чисел (створіть дві початкові змінні). Програма повинна виводити "Перше число більше", "Друге число більше" або "Числа рівні", в залежності від чисел призначених в початкові змінні. (підказка: тернарний оператор можна додавати як одне зі значень іншого тернарного оператора)
*/

// ============

//* #1 Оператор If-Else

// let randomNumber = Math.floor(Math.random() * 20 + 1);

//? 1 - варіант

if (randomNumber % 2 === 0) {
    console.log(`Число ${randomNumber} є парним.`);
} else {
    console.log(`Число ${randomNumber} є НЕ парним.`);
}

//? 2 - варіант

console.log(
    randomNumber % 2 === 0
        ? `Число ${randomNumber} є парним.`
        : `Число ${randomNumber} є НЕ парним.`
);

//* #2 Оператор Switch

let askUserNum = prompt('Введіть число від 1 ДО 6', 5);

switch (askUserNum) {
    case '0':
        console.log('Понеділок');
        break;
    case 1:
        console.log('Вівторок');
        break;
    case 2:
        console.log('Середа');
        break;
    case 3:
        console.log('Четвер');
        break;
    case 4:
        console.log("П'ятниця");
        break;
    case 5:
        console.log('Субота');
        break;
    case 6:
        console.log('Неділя');
        break;

    default:
        console.log('НЕПРАВИЛЬНЕ ЧИСЛО');
        break;
}

//* #3 Тернарний оператор(*)

let num1, num2;
num1 = Math.floor(Math.random() * 10 + 1);
num2 = Math.floor(Math.random() * 10 + 1);

console.log(
    `Перше число: ${num1} Друге число: ${num2}\n\n`,
    num1 > num2
        ? 'Перше число більше'
        : num1 < num2
            ? 'Друге число більше'
            : 'Числа рівні'
);

