/* ЗАВДАННЯ: ФУНКЦІЯ-КАЛЬКУЛЯТОР---
МОЖЛИВИЙ АЛГОРИТМ ДІЙ
Створить окремі функції для арифметичних операцій: Вам потрібно створити чотири функції для додавання, віднімання, множення та ділення. Кожна функція приймає два числа як параметри та повертає результат відповідної операції з ними.

Організуйте ввод даних: Ваш калькулятор повинен запитувати у користувача два числа та символ арифметичної операції, використовуючи prompt(для того, щоб отримати з promt саме числа, використовуйте унарний оператор +).

Обробка операцій: В залежності від символу оператора, який ввів користувач, ваш калькулятор повинен викликати відповідну функцію для виконання обраної операції.

Обробка ділення на нуль: запрограмуйте перевірку яка виключає виконання ділення на 0 (у випадку коли символ оперції є ділення).

Виведення результату: Результат обчислення повинен виводитися в консоль.

Додатково: Спробуйте додати обробку ситуації, коли користувач вводить невідомий оператор.

Приклад роботи програми:
Користувач вводить перше число: 5.
Користувач вводить друге число: 3.
Користувач вводить операцію: *.
Програма виводить: Результат: 15. */

let arg1 = +prompt("Введіть перше число: ");
let arg2 = +prompt("Введіть друге число: ");
let arg3 = prompt(`яку операцію виконати: "+", "-", "*"  чи  "/" ?`);

function dodawania(arg1, arg2) {
  return arg1 + arg2;
}
let rez1 = dodawania(arg1, arg2);

function widnimania(arg1, arg2) {
  return arg1 - arg2;
}
let rez2 = widnimania(arg1, arg2);

function mnozenia(arg1, arg2) {
  return arg1 * arg2;
}
let rez3 = mnozenia(arg1, arg2);

function dilenia(arg1, arg2) {
    if(arg2!==0){
return arg1 / arg2;
    } else return "Не можна ділити на 0!!!"
  
}
let rez4 = dilenia(arg1, arg2);

if (arg3 =="+")  {
  console.log(`${arg1} ${arg3} ${arg2} = ${rez1}`);
} else if (arg3 == "-") {
  console.log(`${arg1} ${arg3} ${arg2} = ${rez2}`);
} else if (arg3 == "*") {
  console.log(`${arg1} ${arg3} ${arg2} = ${rez3}`);
} else if  (arg3 == "/") {
   console.log(`${arg1} ${arg3} ${arg2} = ${rez4}`);  
} else  console.log("Некоректні дані"); 
 

