//* ЗАВДАННЯ

/* 
1-Конкатенація рядків: Складіть повідомлення про ваш улюблений фільм, його жанр і рік виходу, використовуючи конкатенацію через оператор + та шаблонні рядки.
// приклад початкових даних
let film = "Інтерстеллар";
let genre = "наукова фантастика";
let year = 2014;

2-Робота з екрануванням символів: Сформуйте рядок з вашим улюбленим висловом, використовуючи різні типи кавичок і включаючи в нього символи нового рядка та табуляції.
// приклад початкових даних:
// Краще 'запалити' свічку, ніж 'проклинати' темряву

3-Пошук у рядку: Визначте, на якій позиції знаходиться слово "світло" та "тьма" у вірші, і перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.
// приклад початкових даних:
let verse = "Світло кінця тунелю, а за спиною лише темрява";

4-Зміна регістру та заміна частини рядка: Перетворіть всі символи рядка на малі літери, потім замініть слово "сонце" на "місяць".
// приклад початкових даних:
let phrase = "Сонце світить яскраво";
*/

// ============

//* #1-Конкатенація рядків:

// Оголошуємо змінну myFavoriteFilm та ініціалізуємо об'єктним типом
const myFavoriteFilm = {
  'film name': 'У гонитві за щастям',
  genre: 'драма',
  'year of film': 2006,
  'anotation of film': function () {
    console.log(
      `Фільм ${this['film name']} розповідає про\n\hреальну історію, що трапилася на початку 80-х. Кріс Гарнер, продавець нікому не потрібної медичної техніки, вирішує почати життя з нуля: влаштовується на роботу стажистом у трейдингову компанію.`
    );
  },
};

console.log(
  `Мій улюблений фільм це "${myFavoriteFilm['film name']}" випущений у ${myFavoriteFilm['year of film']} за жанром ${myFavoriteFilm['genre']}.`);

// Виводимо анотацію до фільму
console.log('\t\tКоротка анотація до фільму\n\n');
myFavoriteFilm['anotation of film']();

// Використання роздільника для кращого розуміння відображення в консолі
console.log('===='.repeat(10));

//* #2-Робота з екрануванням символів:

let poem = '\t\t"Ліна Костенко – Крила"\n\n\tА й правда, крилатим ґрунту не треба.\n\tЗемлі немає, то буде небо.\n\tНемає поля, то буде воля.\n\tНемає пари, то будуть хмари.\n\tВ цьому, напевно, правда пташина…\n\tА як же людина? А що ж людина?\n\tЖиве на землі. Сама не літає.\n\tА крила має. А крила має!\n\tВони, ті крила, не з пуху-пір\'я,\n\tА з правди, чесноти і довір\'я.\n\tУ кого – з вірності у коханні.\n\tУ кого – з вічного поривання.\n\tУ кого – з щирості до роботи.\n\tУ кого – з щедрості на турботи.\n\tУ кого – з пісні, або з надії,\n\tАбо з поезії, або з мрії.\n\tЛюдина нібито не літає…\n\tА крила має. А крила має!';

console.log(poem);

console.log('===='.repeat(10));

//* #3-Пошук у рядку:

let verse = 'Світло кінця тунелю, а за спиною лише темрява';

console.log(verse.indexOf('світло')); // виведемо індекс з якого розпочинається слово "світло" БЕЗ зміни регістру
console.log(verse.toLowerCase().indexOf('світло')); // виведемо індекс з якого розпочинається слово "світло" З зміною регістру

console.log(verse.indexOf('тьма')); // перевіримо чи є слово "тьма" у рядку БЕЗ зміни регістру
console.log(verse.toLowerCase().indexOf('тьма')); // перевіримо чи є слово "тьма" у рядку З зміною регістру

console.log(verse.startsWith('світло')) // отримаємо false 
console.log(verse.toLowerCase().startsWith('світло')) // отримаємо true ЯКЩО змінимо регістр

console.log('===='.repeat(10));

//* #4-Зміна регістру та заміна частини рядка:

let phrase = 'Сонце світить яскраво';
let newPhrase = phrase.toLowerCase().replace('сонце', 'місяць')


console.log(newPhrase.slice(0,1).toUpperCase().concat(newPhrase.slice(1)));
console.log(newPhrase)
;

