// Цикл While
// Напишіть скрипт, який виведе в консоль всі числа кратні 3 в діапазоні від 33 до 23 включно (саме в порядку від 33 до 23)
let i = 33; 
while (i >= 23) { 
  console.log(i); 
  i -=3; 
}

let indentation1 = "\n";
console.log(indentation1);

// Цикл Do/While
// Створіть програму,  яка генерує та виводить в консоль випадкові числа від 1 до 10, поки не згенерується число 8. Програма також повинна вести підрахунок кількості ітерацій циклу, потрібних для генерації числа 8, та виводити це число після закінчення циклу.

let count = 0; // Лічильник ітерацій
let min = 1;
let max = 10;
let randomNumber; // Змінна для збереження випадкового числа

do {
  randomNumber = Math.floor(Math.random()*(max-min+1)+min); // Генеруємо число від 1 до 10
  console.log(randomNumber); // Виводимо число в консоль
  count++; // Збільшуємо лічильник
} while (randomNumber !== 8); // Повторюємо, поки не випадемо на 8

console.log(`Згенеровано число 8 після ${count} ітерацій.`);



let indentation2 = "\n";
console.log(indentation2);

// Цикл For
// Напишіть код, який використовує цикл for для піднесення числа 2 до степеня від 2 до 10 включно. Результат кожної операції піднесення до степеня повинен бути виведений в консоль у форматі "2 в степені N дорівнює R", де N - це поточна степінь, а R - це результат піднесення до степеня.

for (let n = 2; n <= 10; n++) {
  let result = 1; // Початкове значення для піднесення до степеня
  // Помножуємо 2 на себе n разів
  for (let i = 0; i < n; i++) {
    result *= 2;
  }
  console.log(`2 в степені ${n} дорівнює ${result}`);
}