/* Цикл While
Напишіть скрипт, який виведе в консоль всі числа кратні 3 в діапазоні від 33 до 23 включно (саме в порядку від 33 до 23)  */

console.log("Цикл While:");
let i = 33;
while (i >= 23) {
  console.log(i);
  i = i - 3;
}
console.log("\nЦикл While з приміненням розгалуження:");
let j = 33;
while (j >= 23) {
  if (j % 3 === 0) {
    console.log(j);
  }
  j--;
}
/* Цикл Do/While
Створіть програму,  яка генерує та виводить в консоль випадкові числа від 1 до 10, поки не згенерується число 8. Програма також повинна вести підрахунок кількості ітерацій циклу, потрібних для генерації числа 8, та виводити це число після закінчення циклу. */

console.log("\nЦикл Do/While:");
let min = 1;
let max = 10;
let y;
let k = 0;
do {
  y = Math.floor(Math.random() * (max - min + 1) + min);
  console.log(y);
  k++;
} while (y !== 8);
console.log(`Iтерація номер:${k}`);

/* Цикл For
Напишіть код, який використовує цикл for для піднесення числа 2 до степеня від 2 до 10 включно. Результат кожної операції піднесення до степеня повинен бути виведений в консоль у форматі "2 в степені N дорівнює R", де N - це поточна степінь, а R - це результат піднесення до степеня.  */
console.log("\nЦикл For:");
let a = 0;
for (let N = 2; N <= 10; N++) {
  R = Math.pow(2, N);
  console.log(`2 в степені ${N} дорівнює ${R}`);
}
