/* Створити три об'єкти по наданому опису:

Створення об'єкту "Автомобіль":
Створіть об'єкт під назвою автомобіль.
Об'єкт повинен мати властивості: марка, модель, рік та колір.
Додайте метод показатьІнфо(), який буде виводити інформацію про автомобіль у форматі: "Марка: [марка], Модель: [модель], Рік: [рік], Колір: [колір]". */
const auto = {
  marka: "opel",
  model: "astra",
  rik: 2012,
  colir: "syniy",
  pokazInf: function () {
    console.log(
      `Марка: ${this.marka}, Модель: ${this.model}, Рік: ${this.rik}, Колір: ${this.colir}`
    );
  },
};
auto.pokazInf();

/*
Створення об'єкту "Книга":
Створіть об'єкт під назвою книга.
Об'єкт повинен мати властивості: назва, автор та кількістьСторінок.
Додайте метод описКниги(), який буде виводити інформацію про книгу у форматі: "Назва книги: [назва], Автор: [автор], Кількість сторінок: [кількістьСторінок]".*/


const book = {
  Name_book: "Війна і мир",
  awtor: "Толстой",
  pages: 1408,
  About_book: function () {
    console.log(
      `Назва книги: ${this.Name_book}, Автор: ${this.awtor}, кількість сторінок: ${this.pages}`
    );
  },
};
book.About_book();
/*
Створення об'єкту "Студент":
Створіть об'єкт під назвою студент.
Об'єкт повинен мати властивості: ім'я, прізвище та курс.
Додайте метод представлення(), який буде виводити інформацію у форматі: "Привіт! Мене звати [ім'я] [прізвище], я навчаюся на [курс] курсі".  
*/
const student = {
  first_name: "Іванов",
  second_name: "Олексій",
  kurs: 2,
  Introdusd: function () {
    console.log(
      `Привіт! Мене звати ${this.first_name} ${this.second_name}, я навчаюся на ${this.kurs} курсі`
    );
  },
};
student.Introdusd();