// ЗАВДАННЯ: ФУНКЦІЯ-КАЛЬКУЛЯТОР---

// МОЖЛИВИЙ АЛГОРИТМ ДІЙ
// Створить окремі функції для арифметичних операцій: Вам потрібно створити чотири функції для додавання, віднімання, множення та ділення. Кожна функція приймає два числа як параметри та повертає результат відповідної операції з ними.

// Організуйте ввод даних: Ваш калькулятор повинен запитувати у користувача два числа та символ арифметичної операції, використовуючи prompt(для того, щоб отримати з promt саме числа, використовуйте унарний оператор +).

// Обробка операцій: В залежності від символу оператора, який ввів користувач, ваш калькулятор повинен викликати відповідну функцію для виконання обраної операції.

// Обробка ділення на нуль: запрограмуйте перевірку яка виключає виконання ділення на 0 (у випадку коли символ оперції є ділення).

// Виведення результату: Результат обчислення повинен виводитися в консоль.

// Додатково: Спробуйте додати обробку ситуації, коли користувач вводить невідомий оператор.

// Приклад роботи програми:
// Користувач вводить перше число: 5.
// Користувач вводить друге число: 3.
// Користувач вводить операцію: *.
// Програма виводить: Результат: 15.

/**
 * Функція запускає простий калькулятор запитуючи у користувача два числа та
 * математичну дію, а потім повертає результат
 *
 * @returns {number|string} Результат обчислення або повідомлення про помилку ()
 */

function calc() {
  /**
   * Рекурсивно запитує у користувача число до тих пір, поки не буде введено коректне число.
   *
   * @param {string} message Повідомлення, яке показується користувачу для введення числа.
   * @returns {number} Коректне число, введене користувачем.
   */
  function getNum(message) {
    const input = prompt(message);
    const num = Number(input === null || input === "" ? NaN : input);
    return !isNaN(num)
      ? num
      : getNum("Ви ввели неправильне число, Будь ласка, введіть число ще раз");
  }

  /**
   * Рекурсивно запитує у користувача дію (оператор) до тих пір, поки не буде введено коректний оператор.
   *
   * @param {string} message Повідомлення, яке показується користувачу для введення дії.
   * @returns {string} Оператор математичної дії (+, -, *, /).
   */
  function getAvtion(message) {
    const actionArray = ["+", "-", "*", "/"];
    const act = prompt(message);

    return actionArray.includes(act)
      ? act
      : getAvtion("Неправильна дія, ведіть один з симлолів дії ( + - / *)");
  }

  const num1 = getNum("Введіть перше число");
  const action = getAvtion("Ведіть один з симлолів математичної дії ( + - / *");
  const num2 = getNum("Введіть друге число");

  switch (action) {
    case "+":
      return num1 + num2;
    case "-":
      return num1 - num2;
    case "*":
      return num1 * num2;
    case "/":
      return num2 !== 0 ? num1 / num2 : "Ділення на нуль неможливе!";

    default:
      console.log("Упс, щось не так)");
      break;
  }
}

alert(calc());
