// Функції з параметрами

//функція зваритиКави(цукор=false) {
//    насипати кави в кавоварку;
//    налити води в кавоварку;
//    поставити чашку;
//    ввімкнути кавоварку;
//    дочекатись закінчення процесу приготування кави;
//    якщо (цукор) {додати цукор};
//    return чашка кави
//}

//зваритиКави(true);

//функція приготуватиБутерброд(масло=false, ...rest){
//    змінна "хліб"
//    якщо (масло) {мажемо масло на хліб};
//    якщо (довжина rest > 0) {
//    кладемо на хліб все, що в рест
//    }
//    return бутерброд
//}

//приготуватиБутерброд(true, ...[червона риба, лимон, зелень]);

//функція зарядитиТелефон(рівень=100){
//    поки (заряд телефона <= рівень) {
//        заряджати телефон;
//}
// return телефон;
//}

//зарядитиТелефон(50);

//
//функція прибиратиПідлогу(пилосос=true, помити=false) {
//    якщо (пилосос) {пропилососити підлогу};
//    якщо (помити) {помити підлогу};
//    return фотозвіт в соцмережі :-);
//}

//прибиратиПідлогу();

//функція донат(Стерненку=true, Притулі=true, родичамВЗСУ=true){
//    якщо (Стерненку) {зробити донат};
//    якщо (Притулі) {зробити донат};
//    якщо (родичамВЗСУ) {зробити донат};
//    все одно зробити донат на ЗСУ;
//    return хороший настрій;
//}
//
//донат();

// Функції без параметрів

//функція читатиКнигу() {
//    взяти книгу;
//    відкрити на закладці;
//    читати книгу;
//    return задоволення;
//}
//
//читатиКнигу();

//функція ітиГуляти() {
//    одягнутись;
//    взяти телефон;
//    вийти з дому;
//    замкнути двері;
//    піти гуляти;
//}
//
//ітиГуляти()

//функція спати() {
//    знайти зручне місце і час;
//    спати;
//}
//
//спати();
