// 1 

let film = 'Pirates of the Caribbean';
let genre = 'пригодницький';
let year = 2003;

console.log('\nМій улюблений фільм "' + film + '". ' + `\nЦе ${genre} фільм, який вперше вийшов на екрани в ${year} році.` );

// 2

// Раді б вишню з'їсти,
// Та високо лізти,
// Ой раді б зірвати,
// Та годі дістати!
// "Ой вишеньки-черешеньки,
// Червонії, спілі,
// Чого ж бо ви так високо
// Виросли на гіллі!""

console.log(
  '\n\tРаді б вишню з\'їсти,\n\tТа високо лізти,\n\tОй раді б зірвати,\n\tТа годі дістати!\n' +
    "\t\"Ой вишеньки-черешеньки,\n\tЧервонії, спілі,\n\tЧого ж бо ви так високо\n\tВиросли на гіллі!\""
);

// 3

let verse = 'Світло кінця тунелю, а за спиною лише темрява';
const word1 = 'Світло';
const word2 = 'тьма';

console.log(`\nСлово "${word1}" знаходиться на ${verse.indexOf(word1)} позиції`);
console.log(`Слово "${word2}" знаходиться на ${verse.indexOf(word2)} позиції`);
console.log(`Чи зустрічається слово ${word1}" на початку рядка? Відповідь: ${verse.startsWith(word1)}`);
console.log(`Чи зустрічається слово ${word1}" в кінці рядка? Відповідь: ${verse.endsWith(word1)}`);

// 4

let phrase = 'Сонце світить яскраво';

console.log(`\nПеретворюємо всі символи рядка "${phrase}" на малі літери: "${phrase.toLowerCase()}"`);
console.log(
  `Замінюємо слово "сонце" на "місяць" : "${phrase.toLowerCase().replace('сонце', 'місяць')}"\n`
);






