// 1-Конкатенація рядків: Складіть повідомлення про ваш улюблений фільм, його жанр і рік виходу, використовуючи конкатенацію через оператор + та шаблонні рядки.

let film = "Ґран Туризмо";
let genre = "Екшн/Спортивний";
let year = 2023;
console.log(`Мій улюблений фільм - ${film}, заснований на реальних подіях.\n` + `Жанр фільму - ${genre}\n` + `Рік виходу - ${year}`); 
/*Мій улюблений фільм - Ґран Туризмо, заснований на реальних подіях.
Жанр фільму - Екшн/Спортивний
Рік виходу - 2023 */

// 2-Робота з екрануванням символів: Сформуйте рядок з вашим улюбленим висловом, використовуючи різні типи кавичок і включаючи в нього символи нового рядка та табуляції.

let utterance =
  "Недостатньо тільки 'отримати' знання\t-\tїх треба 'застосувати'.\nНедостатньо тільки\"бажати\" \t-\tтреба \"діяти\".";
console.log(utterance);
/*Недостатньо тільки 'отримати' знання	-	 їх треба 'застосувати'.
Недостатньо тільки "бажати"	 -	 треба "діяти". */

// 3-Пошук у рядку: Визначте, на якій позиції знаходиться слово "світло" та "тьма" у вірші, і перевірте, чи зустрічається слово "світло" на початку чи в кінці рядка.

let verse = "Світло кінця тунелю, а за спиною лише темрява";
console.log(verse.indexOf("світло"));
console.log(verse.indexOf("Світло"));
console.log(verse.indexOf("тьма"));
console.log(verse.startsWith("світло"));
console.log(verse.endsWith("світло"));
console.log(verse.startsWith("Світло"));
console.log(verse.endsWith("Світло"));

// 4-Зміна регістру та заміна частини рядка: Перетворіть всі символи рядка на малі літери, потім замініть слово "сонце" на "місяць".

let phrase = "Сонце світить яскраво";
console.log(phrase.toLowerCase());
// сонце світить яскраво

console.log(phrase.replace('cонце', 'Місяць'));
// Місяць світить яскраво