/*Оператор If-Else
Напишіть скрипт, який перевіряє, чи є число записане в початкову змінну парним. Програма повинна вивести в консоль "Число парне" або "Число непарне" в залежності від числа яке призначено у початкову змінну.*/
let number = 7;                      //число записане в початкову змінну 
if (number % 2 === 0) {             //перевіряє  число на парність
    console.log(`Число парне`);    //виводить в консоль "Число парне"
} else {                           //або
    console.log(`Число непарне`); //виводить в консоль "Число непарне"
}

//Оператор Switch
//Створіть програму, яка для чисел від 0 до 6  виводить назву дня тижня, відповідну цьому числу (0 - понеділок, 1 - вівторок, і т.д.). Якщо число не входить в цей діапазон, програма повинна вивести "Неправильне число".
let maxNum = 10;
let minNum = 0;
let randomNumber = Math.floor((Math.random() * (maxNum - minNum + 1)) + minNum);
switch (randomNumber) {
    case 0:
        console.log("Monday");
        break;
    case 1:
        console.log(`Tuesday`);
        break;
    case 2:
        console.log(`Wendnesday`);
        break;
    case 3:
        console.log(`Thursday`);
        break;
    case 4:
        console.log(`Friday`);
        break;
    case 5:
        console.log(`Saturday`);
        break;
    case 6:
        console.log("Sunday");
        break;
    default:
        console.log(`Неправильне число`)

}

//Тернарний оператор(*)
//Напишіть код, який використовує тернарний оператор, для визначення більшого з двох чисел (створіть дві початкові змінні). Програма повинна виводити "Перше число більше", "Друге число більше" або "Числа рівні", в залежності від чисел призначених в початкові змінні. (підказка: тернарний оператор можна додавати як одне зі значень іншого тернарного оператора)
let a = 2;                        //1 початковa зміннa
let b = 2;                        //2 початковa зміннa
let result = (a > b)
    ? `Перше число більше`
    : (a < b)
        ? `Друге число більше`
        : `Числа рівні`;
console.log(result);
