//1. Напишіть (СЛОВАМИ НЕ КОДОМ) п'ять прикладів з повсякденного життя, які можна вважати аналогами функцій з параметрами в програмуванні. Для кожного прикладу вкажіть, які є 'параметри', які 'аргументи' та який 'результат' повертається.

// function Спекти Млинці
// параметри: (список інгрідієнтів з кількістю, пательня, пічка)
// аргументи: - список інгрідієнтів {
//               Борошно: 250 мл,
//               Молоко: 250мл,
//               Яйця: 2 штуки,
//               Цукор: 50 гр,
//               Сіль: 5гр.
//               Рослинна олія: 10мл,
//               Рзпушувач: 5гр.
//              };
//            - пательня млинна;
//            - пічка газова.
// результат: 20 млинців.

// function Сплатити комуналку
// параметри: (мобільний телефон, гроші на банківському рахунку, сформовані рахунки в додатку "Приватбанк" на 10 число місяця)
// аргументи: - мобільний телефон Samsung;
//            - на рахунку в "Приватбанк" є 4000грн;
//            - true.
// результат: рахунки сплачено.

// function Купити каву в автоматі
// параметри: (кавовий автомат працює, готівкові гроші, вид кави)
// аргументи: - true;
//            - 50грн;
//            - капучіно.
// результат: кава в стаканчику.

// function Прокинутися вчасно на роботу
// параметри: (робочій день, будильник, будильник заведено)
// аргументи: - понеділок;
//            - будильник на мобільному на 7:00;
//            - true.
// результат: на роботу прокинулася вчасно.

// function Посадити домашню рослину
// параметри: (горщик, рослина, земля, вода, лопатка, рукавички)
// аргументи: - пластиковий на 5літрів;
//            - фікус;
//            - для фікусів;
//            - 200 мл;
//            - садова;
//            - гумові.
// результат: ще один фікус на підвіконні.

// 2. Напишіть (СЛОВАМИ НЕ КОДОМ) три приклади з повсякденного життя, які можна вважати аналогами функцій без параметрів в програмуванні. Для кожного прикладу вкажіть, який 'результат' відбувається автоматично, не вимагаючи від вас додаткових дій або передавання аргументів.

// function Схід сонця
// ніч пройшла -
// результат: сонце зійшло.

// function Намокнути в річці
// в річку зайшов -
// результат: мокрий.

// function кинути предмет
// руки розжати -
// результат: предмет впаде.