//! 1:
// 1. Підйом на ліфті.Параметри - напрямок(вверх чи вниз) та поверх. Аргументи - вниз, 1 поверх. Результат - перевезення нас на потрібний нам поверх.
// 2. Духова піч.Параметри - режим, температура та час приготування.Аргументи - гриль, 200 градусів, 120хв.Результат - приготована їжа.
// 3. Будильник.Параметри - дата та час.Аргументи - завтра, 7: 40 ранку.Результат - дзвінок будильника.
// 4. Пральна машина.Параметри - режим, час, температура.Аргументи - звичайне прання, 30хв, 80градусів.Результат - чистий одяг.
// 5. Телефонний дзвінок. Параметр - номер телефону. Аргумент - +380997771122. Результат -  дзвінок.



//! 2:
// 1. Звичайний телефонний знімок.Натискання кнопки("виклик"), результат - фото в галереї.
// 2. Світло в холодильнику.Відкриття дверців("виклик"), резуьтат - видимість всередині.
// 3. Змивання в туалеті.Натискання кнопки("виклик"), результат - чистий туалет.