
// ЗАВДАННЯ: ФУНКЦІЯ-КАЛЬКУЛЯТОР---
// МОЖЛИВИЙ АЛГОРИТМ ДІЙ
// Створить окремі функції для арифметичних операцій: Вам потрібно створити чотири функції для додавання, віднімання, множення та ділення. Кожна функція приймає два числа як параметри та повертає результат відповідної операції з ними.

// Організуйте ввод даних: Ваш калькулятор повинен запитувати у користувача два числа та символ арифметичної операції, використовуючи prompt(для того, щоб отримати з promt саме числа, використовуйте унарний оператор +).

// Обробка операцій: В залежності від символу оператора, який ввів користувач, ваш калькулятор повинен викликати відповідну функцію для виконання обраної операції.

// Обробка ділення на нуль: запрограмуйте перевірку яка виключає виконання ділення на 0 (у випадку коли символ оперції є ділення).

// Виведення результату: Результат обчислення повинен виводитися в консоль.

// Додатково: Спробуйте додати обробку ситуації, коли користувач вводить невідомий оператор.

// Приклад роботи програми:
// Користувач вводить перше число: 5.
// Користувач вводить друге число: 3.
// Користувач вводить операцію: *.
// Програма виводить: Результат: 15.

let num1 = parseInt(prompt('введіть 1 число'))
let num2 = parseInt(prompt('введіть 2 число'))

let result = prompt('вкажіть символ арифметичної операції')

function getSum(num1, num2){
    let sum = num1 + num2
    return sum
}
function getSubtraction (num1, num2){
    let subtraction  = num1 - num2
    return subtraction
}
function getMultiply(num1, num2){
    let multiply = num1 * num2
    return multiply
}
function getDiviDe(num1, num2){
    if(num2 === 0|| num1 === 0){
        alert('на нуль ділити не можна')
        return
    }
    let divide = num1 / num2
    return divide
}

function getResult(result){
    switch(result){
        case '+' : console.log(getSum(num1, num2)); ;
        break;
        case '-' : console.log(getSubtraction(num1, num2)); 
        break;
        case '*' : console.log(getMultiply(num1, num2)); 
        break;
        case '/' : console.log(getDiviDe(num1, num2)); 
        break;
        default : console.log('невідомий оператор'); 
    }
}
getResult(result)