// Цикл While
let end = 34
let i = end

while (i !== 23) {
    if (i % 3 === 0) {
        console.log(i)
        
    } else if (i === 23) {
        break
    }
    i--
};
// Цикл Do/While
// Створіть програму,  яка генерує та виводить в консоль випадкові числа від 1 до 10, поки не згенерується число 8. Програма також повинна вести підрахунок кількості ітерацій циклу, потрібних для генерації числа 8, та виводити це число після закінчення циклу.
let i = 0
let num
do{
    num = Math.floor(Math.random() * 10) + 1
    if(num === 8){
        console.log(i);
    }
    i++
}while(num !== 8)

// Цикл For
// Напишіть код, який використовує цикл for для піднесення числа 2 до степеня від 2 до 10 включно. Результат кожної операції піднесення до степеня повинен бути виведений в консоль у форматі "2 в степені N дорівнює R", де N - це поточна степінь, а R - це результат піднесення до степеня.

let num = 2
for(let N = 2; N <= 10; N++){
    let R = num ** N
    console.log(`2 в степені ${N} дорівнює ${R}`)
}