// консистенція тіста
let batterConsistency = ["як рідка сметана", "як густа сметана"];
// температура пательні  в градусах Цельсія
let patelniaTemperature = 220;
// час приготування, хвилин
let cookingTime = 40;
// кількість перевертань
let flipCount = 2;
// список інгредієнтів
let ingredientList = {
    "молоко": 1,
    "яйця": 4,
    "борошно": 0.5,
    "олія": 2,
    "цукор": 1.5,
    "сіль": 0.5,
};
// об'єм тіста в літрах
let batterVolume = 1.5;
// розмір порції в кілограмах
let servingSize = 0.15;
// вибір начинки
let toppingChoice = ["сир", "полуничний джем", "абрикосовий джем", "сливовий джем", "гриби"];
// залишок тіста в кілограмах
let remainingBatter = 0;
// рівень олії в пательні в мм
let patelniaOilLevel = 2;
