export const episodes = [
  {
    id: 1,
    name: "Шоколадний майстер Тео: Історія успіху",
  },
  {
    id: 2,
    name: "Кондитерські інновації від Софії Крем",
  },
  {
    id: 3,
    name: "Секрети ідеального тіста з шеф-кухарем Максом",
  },
  {
    id: 4,
    name: "Мистецтво прикрашання тортів з Лілі Глазур",
  },
  {
    id: 5,
    name: "Веганські десерти: революція від Олівії Зелені",
  },
  {
    id: 6,
    name: "Історія французьких макарунів з П'єром Мигдаль",
  },
  {
    id: 7,
    name: "Молекулярна кондитерська: експерименти Алекса Науки",
  },
  {
    id: 8,
    name: "Традиційні рецепти у сучасній подачі від Анни Спадок",
  },
  {
    id: 9,
    name: "Кава та десерти: ідеальні пари від баристи Марко",
  },
  {
    id: 10,
    name: "Цукрова флористика: майстер-клас Рози Квітки",
  },
  {
    id: 11,
    name: "Шоколадні скульптури: мистецтво Карло Какао",
  },
  {
    id: 12,
    name: "Десерти без цукру: здорові альтернативи від Емми Стевії",
  },
];
