// Оператор If-Else
// start = prompt("Введіть число: ", "");

// if (start % 2 === 0) {
//   alert("Число парне");
//   console.log("Число парне");
// } else {
//   alert("Число непарне");
//   onsole.log("Число непарне");
// }

// Оператор Switch
// let day_of_week = prompt(
//   "Введіть день тижня числом від 0 до 6, де 0 - це понеділок, а 6 - це неділя: "
// );
// switch (day_of_week) {
//   case '0':
//     alert(`День тижня - понеділок`);
//     console.log(`День тижня - понеділок`);
//     break;
//   case '1':
//     alert(`День тижня - вівторок`);
//     console.log(`День тижня - вівторок`);
//     break;
//   case '2':
//     alert(`День тижня - середа`);
//     console.log(`День тижня - середа`);
//     break;
//   case '3':
//     alert(`День тижня - четвер`);
//     console.log(`День тижня - четвер`);
//     break;
//   case '4':
//     alert(`День тижня - п'ятниця`);
//     console.log(`День тижня - п'ятниця`);
//     break;
//   case '5':
//     alert(`День тижня - субота`);
//     console.log(`День тижня - субота`);
//     break;
//   case '6':
//     alert(`День тижня - неділя`);
//     console.log(`День тижня - неділя`);
//     break;

//   default:
//     alert(`Введене некоректне число, введіть від 0 до 6!`);
//     console.log(`Введене некоректне число, введіть від 0 до 6!`);
//     break;
// }



// Тернарний оператор(*)
// let a = prompt("Введіть число #1: ");
// let b = prompt("Введіть число #2: ");

// let test1 = a === b ? (console.log(`Числа рівні!`)) : (a > b ? console.log(`Перше число більше!`) : console.log(`Друге число більше!`));
